barangay/stress.yml
config:
  target: "https://example.com"
  phases:
    # Initial ramp-up phase: Gradually increase traffic
    - duration: 600               # 10 minutes ramp-up
      arrivalRate: 10              # Start with 10 users/sec
      rampTo: 100                 # Ramp to 100 users/sec over the first 10 minutes

    # Stress phase: Peak load of 500 users/sec for 10 minutes
    - duration: 600               # 10 minutes of peak load
      arrivalRate: 500             # Sustained 500 users/sec

    # Sudden spike: Simulate a sudden traffic spike of 1000 users/sec
    - duration: 300               # 5 minutes of extreme stress
      arrivalRate: 1000            # Rapidly ramp to 1000 users/sec

    # Ramp-down phase: Gradually decrease the traffic
    - duration: 300               # 5 minutes of ramp-down
      arrivalRate: 50              # Decrease to 50 users/sec

  tls:
    rejectUnauthorized: false

scenarios:
  - name: "Barangay Stress Test on /"
    flow:
      - get:
          url: "/"
          expect:
            - statusCode: 200
          # Adding think time to simulate real user behavior
          think: 1  # 1 second think time bet